Revit 2024 API
TemperatureRatingType.InsulationTypes Property
 Get all insulation types defined in this temperature rating type and its corresponding material type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public InsulationTypeSet InsulationTypes { get; }
Visual Basic
Public ReadOnly Property InsulationTypes As InsulationTypeSet
	Get
Visual C++
public:
property InsulationTypeSet^ InsulationTypes {
	InsulationTypeSet^ get ();
}
See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace